#include<stdio.h>

//1:

//int main()
//{
//	int a = 0;//百位数
//	int b = 0;//十位数
//	int c = 0;//个位数	
//	int count = 0;
//	int i = 100;
//	for (i = 100; i < 1000; i++)
//	{
//		a = i / 100;
//		b = i / 10 % 10;
//		c = i % 10;
//		if (a < 5 && b>0 && b < 5 && c < 5 && c>0)
//		{
//			if ((a != b) && (b != c) && (a != c))
//			{
//				printf("%d ", i);
//				count++;
//			}
//		}
//		
//	}
//	printf("\n%d\n", count);
//	return 0;
//}

//int main()
//{
//	int a, b, c;
//	int count = 0;
//	for (a = 1; a < 5; a++)
//	{
//		for (b = 1; b < 5; b++)
//		{
//			for (c = 1; c < 5; c++)
//			{
//				if ((a != b) && (a != c) && (b != c))
//				{
//					printf("%d%d%d ", a, b, c);
//					count++;
//				}
//			}
//		}
//	}
//	printf("\n%d\n", count);
//	return 0;
//}


//2:

//int main()
//{
//	int i = 0;//利润
//	scanf("%d", &i);
//	int f = 0;//奖金
//	if (i <= 100000)
//	{
//		f = 0.1 * f;
//	}
//	else if (i <= 200000)
//	{
//		f = 0.1 * 100000 + 0.075 * (i - 100000);
//	}
//	else if (i <= 400000)
//		f = 0.1 * 100000 + 0.075 * 100000 + 0.05 * (i - 200000);
//	else if (i <= 600000)
//		f = 0.1 * 100000 + 0.075 * 100000 + 0.05 * 200000 + 0.03 * (i - 400000);
//	else if (i <= 1000000)
//		f = 0.1 * 100000 + 0.075 * 100000 + 0.05 * 200000 + 0.03 * 400000 + 0.015 * (i - 600000);
//	else
//		f = 0.1 * 100000 + 0.075 * 100000 + 0.05 * 200000 + 0.03 * 400000 + 0.015 * 400000 + 0.01 * (i - 1000000);
//	printf("%d", f);
//	return 0;
//}

//int main()
//{
//	int i = 0;//利润
//	scanf("%d", &i);
//	int f = 0;//奖金
//	int f1 = 0.1 * 100000;
//	int f2 = f1 + 0.075 * 100000;
//	int f3 = f2 + 0.05 * 200000;
//	int f4 = f3 + 0.03 * 400000;
//	int f5 = f4 + 0.015 * 400000;
//	if (i <= 100000)
//		f = 0.1 * f;
//	else if (i <= 200000)
//		f = f1 + 0.075 * (i - 100000);
//	else if (i <= 400000)
//		f = f2 + 0.05 * (i - 200000);
//	else if (i <= 600000)
//		f = f3 + 0.03 * (i - 400000);
//	else if (i <= 1000000)
//		f = f4 + 0.015 * (i - 600000);
//	else
//		f = f5 + 0.01 * (i - 1000000);
//	printf("%d", f);
//	return 0;
//}

//3:

//#include<math.h>
//int main()
//{
//	int i = 0;
//	for (;; i++)
//	{
//		double tmp = sqrt(i + 100);
//		int tmp1 = (int)sqrt(i+100);
//		if ( tmp==tmp1)
//		{
//			tmp = sqrt(i + 100 + 168);
//			tmp1 = (int)sqrt(i + 100 + 168);
//			if (tmp == tmp1)
//			{
//				printf("%d\n", i);
//				break;
//			}
//		}
//
//	}
//	return 0;
//}

//1、x + 100 = n^2, x + 100 + 168 = m^2
//2、计算等式：m^2 - n^2 = (m + n)(m - n) = 168
//3、设置： m + n = i，m - n = j，i * j = 168，
//4、可得： m = (i + j) / 2， n = (i - j) / 2，i 和 j 要么都是偶数，要么都是奇数。
//5、从 3 和 4 推导可知道，i 与 j 均是大于等于 2 的偶数。
//6、由于 i * j = 168， j >= 2，则 1 < i < 168 / 2 + 1。
//int main()
//{
//	int i = 2;
//	for (i = 2; i < 168 / 2 + 1; i += 2 )
//	{
//		if (168 % i == 0)
//		{
//			int j = 168 / i;
//			if (i > j && j % 2 == 0)
//			{
//				int m = (i + j) / 2;
//				int n = (i - j) / 2;
//				printf("%d ", n * n - 100);
//			}
//		}
//	}
//	return 0;
//}